expFold = monkey01
mdl_name = PRFR_CNN2D_RODS
path_model_save_base = /home/sidrees/scratch/RetinaPredictors/data/monkey01/ICLR2023/scot-0.3-3-Rstar
fname_data_train_val_test = /home/sidrees/scratch/RetinaPredictors/data/monkey01/datasets/monkey01_dataset_train_val_test_scot-0.3-3-Rstar.h5
path_dataset_base = /home/saad/data/analyses/data_kiersten
path_existing_mdl = 0
nb_epochs = 80
bz_ms = 5000
runOnCluster = 1
USE_CHUNKER = 1
trainingSamps_dur = 40
validationSamps_dur = 0
CONTINUE_TRAINING = 0
idxStart_fixedLayers = 0
idxEnd_fixedLayers = -1
info = 
lr = 0.001
lr_fac = 1
use_lrscheduler = 1.0
idx_unitsToTake = [ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23
 24 25 26 27 28 29 30 31 32 33 34 35 36]
initial_epoch = 0
chan1_n = 8
filt1_size = 9
chan2_n = 16
filt2_size = 7
chan3_n = 18
filt3_size = 5
BatchNorm = 1
MaxPool = 1
filt_temporal_width = 120
lr_schedule = def lr_scheduler(epoch,lr):
     arr_scheduler = np.array([[3,10],
                           [10,10],
                           [15,1],
                           [20,10],
                           [30,10],
                           [50,10]])
 
 
     idx = np.where(arr_scheduler[:,0]==epoch)[0]
     
     if idx.size>0:
         idx = idx[0]
         lr_fac = arr_scheduler[idx,1]
         lr = lr/lr_fac
     
     return lr

Model: "PRFR_CNN2D_RODS"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 180, 30, 39)]     0         
_________________________________________________________________
reshape (Reshape)            (None, 180, 1170)         0         
_________________________________________________________________
photoreceptor_rods_reike (ph (None, 180, 1170)         22        
_________________________________________________________________
reshape_1 (Reshape)          (None, 180, 30, 39)       0         
_________________________________________________________________
tf.__operators__.getitem (Sl (None, 120, 30, 39)       0         
_________________________________________________________________
layer_normalization (LayerNo (None, 120, 30, 39)       280800    
_________________________________________________________________
CNNs_start (Conv2D)          (None, 8, 22, 31)         77768     
_________________________________________________________________
flatten (Flatten)            (None, 5456)              0         
_________________________________________________________________
batch_normalization (BatchNo (None, 5456)              21824     
_________________________________________________________________
reshape_2 (Reshape)          (None, 8, 22, 31)         0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 8, 11, 15)         0         
_________________________________________________________________
gaussian_noise (GaussianNois (None, 8, 11, 15)         0         
_________________________________________________________________
activation (Activation)      (None, 8, 11, 15)         0         
_________________________________________________________________
conv2d (Conv2D)              (None, 16, 5, 9)          6288      
_________________________________________________________________
flatten_1 (Flatten)          (None, 720)               0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 720)               2880      
_________________________________________________________________
reshape_3 (Reshape)          (None, 16, 5, 9)          0         
_________________________________________________________________
gaussian_noise_1 (GaussianNo (None, 16, 5, 9)          0         
_________________________________________________________________
activation_1 (Activation)    (None, 16, 5, 9)          0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 18, 1, 5)          7218      
_________________________________________________________________
flatten_2 (Flatten)          (None, 90)                0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 90)                360       
_________________________________________________________________
reshape_4 (Reshape)          (None, 18, 1, 5)          0         
_________________________________________________________________
gaussian_noise_2 (GaussianNo (None, 18, 1, 5)          0         
_________________________________________________________________
activation_2 (Activation)    (None, 18, 1, 5)          0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 90)                0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 90)                360       
_________________________________________________________________
dense (Dense)                (None, 37)                3367      
_________________________________________________________________
activation_3 (Activation)    (None, 37)                0         
=================================================================
Total params: 400,887
Trainable params: 388,157
Non-trainable params: 12,730
_________________________________________________________________






expFold = monkey01
mdl_name = PRFR_CNN2D_RODS
path_model_save_base = /home/sidrees/scratch/RetinaPredictors/data/monkey01/ICLR2023/scot-0.3-3-Rstar
fname_data_train_val_test = /home/sidrees/scratch/RetinaPredictors/data/monkey01/datasets/monkey01_dataset_train_val_test_scot-0.3-3-Rstar.h5
path_dataset_base = /home/saad/data/analyses/data_kiersten
path_existing_mdl = 0
nb_epochs = 80
bz_ms = 5000
runOnCluster = 1
USE_CHUNKER = 1
trainingSamps_dur = 40
validationSamps_dur = 0
CONTINUE_TRAINING = 0
idxStart_fixedLayers = 0
idxEnd_fixedLayers = -1
info = 
lr = 0.001
lr_fac = 1
use_lrscheduler = 1.0
idx_unitsToTake = [ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23
 24 25 26 27 28 29 30 31 32 33 34 35 36]
initial_epoch = 0
chan1_n = 8
filt1_size = 9
chan2_n = 16
filt2_size = 7
chan3_n = 18
filt3_size = 5
BatchNorm = 1
MaxPool = 1
filt_temporal_width = 120
lr_schedule = def lr_scheduler(epoch,lr):
     arr_scheduler = np.array([[3,10],
                           [10,10],
                           [15,1],
                           [20,10],
                           [30,10],
                           [50,10]])
 
 
     idx = np.where(arr_scheduler[:,0]==epoch)[0]
     
     if idx.size>0:
         idx = idx[0]
         lr_fac = arr_scheduler[idx,1]
         lr = lr/lr_fac
     
     return lr

Model: "PRFR_CNN2D_RODS"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 180, 30, 39)]     0         
_________________________________________________________________
reshape (Reshape)            (None, 180, 1170)         0         
_________________________________________________________________
photoreceptor_rods_reike (ph (None, 180, 1170)         22        
_________________________________________________________________
reshape_1 (Reshape)          (None, 180, 30, 39)       0         
_________________________________________________________________
tf.__operators__.getitem (Sl (None, 120, 30, 39)       0         
_________________________________________________________________
layer_normalization (LayerNo (None, 120, 30, 39)       280800    
_________________________________________________________________
CNNs_start (Conv2D)          (None, 8, 22, 31)         77768     
_________________________________________________________________
flatten (Flatten)            (None, 5456)              0         
_________________________________________________________________
batch_normalization (BatchNo (None, 5456)              21824     
_________________________________________________________________
reshape_2 (Reshape)          (None, 8, 22, 31)         0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 8, 11, 15)         0         
_________________________________________________________________
gaussian_noise (GaussianNois (None, 8, 11, 15)         0         
_________________________________________________________________
activation (Activation)      (None, 8, 11, 15)         0         
_________________________________________________________________
conv2d (Conv2D)              (None, 16, 5, 9)          6288      
_________________________________________________________________
flatten_1 (Flatten)          (None, 720)               0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 720)               2880      
_________________________________________________________________
reshape_3 (Reshape)          (None, 16, 5, 9)          0         
_________________________________________________________________
gaussian_noise_1 (GaussianNo (None, 16, 5, 9)          0         
_________________________________________________________________
activation_1 (Activation)    (None, 16, 5, 9)          0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 18, 1, 5)          7218      
_________________________________________________________________
flatten_2 (Flatten)          (None, 90)                0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 90)                360       
_________________________________________________________________
reshape_4 (Reshape)          (None, 18, 1, 5)          0         
_________________________________________________________________
gaussian_noise_2 (GaussianNo (None, 18, 1, 5)          0         
_________________________________________________________________
activation_2 (Activation)    (None, 18, 1, 5)          0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 90)                0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 90)                360       
_________________________________________________________________
dense (Dense)                (None, 37)                3367      
_________________________________________________________________
activation_3 (Activation)    (None, 37)                0         
=================================================================
Total params: 400,887
Trainable params: 388,157
Non-trainable params: 12,730
_________________________________________________________________
